## 문제 91~100

In [1]:
import pandas as pd
import numpy as np

In [2]:
# 91 ~ 93
data = {'이름': ['김은수', '박정민', '이하나'],
        '나이': [35, 30, 28],
        '직책': ['과장', '대리', '대리']
       }

df = pd.DataFrame(data)

In [3]:
df

    이름  나이  직책
0  김은수  35  과장
1  박정민  30  대리
2  이하나  28  대리

In [4]:
# 94
data = [
    ["037730", "3R", 1510, 7.36],
    ["036360", "3SOFT", 1790, 1.65],
    ["005760", "ACTS", 1185, 1.28],
]
columns = ["종목코드", "종목명", "현재가", "등락률"]
df = pd.DataFrame(data=data, columns=columns)
df

     종목코드    종목명   현재가   등락률
0  037730     3R  1510  7.36
1  036360  3SOFT  1790  1.65
2  005760   ACTS  1185  1.28

In [11]:
df.index = df['종목코드']
df.drop('종목코드', axis=1)

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [13]:
new_df = pd.DataFrame(data=data, columns=columns)
new_df

     종목코드    종목명   현재가   등락률
0  037730     3R  1510  7.36
1  036360  3SOFT  1790  1.65
2  005760   ACTS  1185  1.28

In [14]:
new_df.set_index('종목코드')

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [15]:
# 95
index = ["037730", "036360", "005760"]
data = [["3R", "1510"],
         ["3SOFT", 1790],
         ["ACTS", 1185]]
columns = ["종목명", "현재가"]

df = pd.DataFrame(data, index=index, columns=columns)
df

          종목명   현재가
037730     3R  1510
036360  3SOFT  1790
005760   ACTS  1185

In [19]:
# 96
num = np.arange(8)
reshape = num.reshape((2,4))
pd.DataFrame(reshape)

   0  1  2  3
0  0  1  2  3
1  4  5  6  7

In [30]:
# 97
index = ["037730", "036360", "005760"]
data = [["3R", "1510"],
         ["3SOFT", 1790],
         ["ACTS", 1185]]
columns = ["종목명", "현재가"]
df = pd.DataFrame(data=data, index=index, columns=columns)
df

          종목명   현재가
037730     3R  1510
036360  3SOFT  1790
005760   ACTS  1185

In [31]:
# 97 answer
df.reset_index()

    index    종목명   현재가
0  037730     3R  1510
1  036360  3SOFT  1790
2  005760   ACTS  1185

In [32]:
# 98
df.index

Index(['037730', '036360', '005760'], dtype='object')

In [33]:
# 99
df.columns

Index(['종목명', '현재가'], dtype='object')

In [34]:
# 100
d = {'col1': [1, 2], 'col2': [3, 4]}
pd.DataFrame(d).astype(np.int8)

   col1  col2
0     1     3
1     2     4

## 문제 101~110

In [36]:
# 101
data = [
    ["037730", "3R", 1510, 7.36],
    ["036360", "3SOFT", 1790, 1.65],
    ["005760", "ACTS", 1185, 1.28],
]
columns = ["종목코드", "종목명", "현재가", "등락률"]
df = pd.DataFrame(data=data, columns=columns)
df.set_index('종목코드', inplace=True)
df["현재가"]

종목코드
037730    1510
036360    1790
005760    1185
Name: 현재가, dtype: int64

In [37]:
# 102
df["현재가"].dtype

dtype('int64')

In [38]:
pd.to_DataFrame(df["현재가"])

AttributeError: module 'pandas' has no attribute 'to_DataFrame'

In [39]:
# 102 answer
df[["현재가"]]

         현재가
종목코드
037730  1510
036360  1790
005760  1185

In [41]:
# 103
df.loc[:, ["현재가", "등락률"]]

         현재가   등락률
종목코드
037730  1510  7.36
036360  1790  1.65
005760  1185  1.28

In [42]:
# 104
df.iloc[:, 0]

종목코드
037730       3R
036360    3SOFT
005760     ACTS
Name: 종목명, dtype: object

In [43]:
# 105
df.iloc[:, -1]

종목코드
037730    7.36
036360    1.65
005760    1.28
Name: 등락률, dtype: float64

In [44]:
# 106
df.iloc[:, [0, 2]]

          종목명   등락률
종목코드
037730     3R  7.36
036360  3SOFT  1.65
005760   ACTS  1.28

In [49]:
# 107
df.loc['037730']

종목명      3R
현재가    1510
등락률    7.36
Name: 037730, dtype: object

In [50]:
# 108 또잉?

In [51]:
# 109
df.iloc[0, 2]

7.36

In [52]:
# 110
df.iat[0, 2]

7.36

In [53]:
df.at["037730", "등락률"]

7.36

## 문제 111~120

In [54]:
# 패스

## 문제 121~130

In [55]:
# 121
data = [
    ["037730", "3R", 1510, 7.36],
    ["036360", "3SOFT", 1790, 1.65],
    ["005760", "ACTS", 1185, 1.28],
]
columns = ["종목코드", "종목명", "현재가", "등락률"]
df = pd.DataFrame(data=data, columns=columns)
df.set_index('종목코드', inplace=True)

In [56]:
df

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [57]:
cond = df['현재가'] > 1500
df[cond]

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [61]:
# 122 answer
cond2 = (df['현재가'] <= 1700) & (df['현재가'] >= 1500)
df[cond2]

       종목명   현재가   등락률
종목코드
037730  3R  1510  7.36

In [64]:
# 123
df['목표가'] = df['현재가'].map(lambda x: x * 1.1)
df

          종목명   현재가   등락률     목표가
종목코드
037730     3R  1510  7.36  1661.0
036360  3SOFT  1790  1.65  1969.0
005760   ACTS  1185  1.28  1303.5

In [65]:
# 123 answer
# df['목표가'] = df['현재가'] * 1.1

In [81]:
# 124

# concat 을 쓰려고 했음

ValueError: Shape of passed values is (3, 1), indices imply (1, 3)

In [67]:
# 124 answer
df.loc["066570"] = ["LG전자", 60000, 3.84]
df

ValueError: cannot set a row with mismatched columns

In [82]:
# 125
df = pd.DataFrame(data = [[1, 2, 3], [4, 5, 6]], columns=["A", "B", "C"])
df.columns = ['a', 'b', 'c']
df

   a  b  c
0  1  2  3
1  4  5  6

In [83]:
# 126
df = pd.DataFrame(data = [[1, 2, 3], [4, 5, 6]], columns=["A", "B", "C"])
df.rename(columns={'A': 'a'}, inplace=True)
df

   a  B  C
0  1  2  3
1  4  5  6

In [84]:
# 127
data = {"카카오": [np.nan, 221, 35], "NAVER": [52, 47, 3]}
index = [2019, 2020, 2021]
df = pd.DataFrame(data=data, index=index)
df.index.name = "year"
df.columns.name = "company"
df

company    카카오  NAVER
year
2019       NaN     52
2020     221.0     47
2021      35.0      3

In [93]:
# 128
df = df.reindex(columns=['NAVER', '카카오'])

In [94]:
df

company  NAVER    카카오
year
2019        52    NaN
2020        47  221.0
2021         3   35.0

In [96]:
# 129
data = {"카카오": [np.nan, 221, 35], "NAVER": [52, 47, 3]}
index = [2019, 2020, 2021]
df = pd.DataFrame(data=data, index=index)
df.drop('NAVER', axis=1)

        카카오
2019    NaN
2020  221.0
2021   35.0

In [97]:
# 130
data = {"카카오": [np.nan, 221, 35], 
        "NAVER": [52, 47, 3],
        "삼성전자": [17, 21, 13]}
index = [2019, 2020, 2021]
df = pd.DataFrame(data=data, index=index)
df.drop(["카카오", "NAVER"], axis=1)

      삼성전자
2019    17
2020    21
2021    13

## 문제 131~140

In [99]:
# 131
data = [
    {"cd":"A060310", "nm":"3S", "close":"2,920"},
    {"cd":"A095570", "nm":"AJ네트웍스", "close":"6,250"},
    {"cd":"A006840", "nm":"AK홀딩스", "close":"29,700"},
    {"cd":"A054620", "nm":"APS홀딩스", "close":"19,400"}
]
df = pd.DataFrame(data=data)
df

        cd      nm   close
0  A060310      3S   2,920
1  A095570  AJ네트웍스   6,250
2  A006840   AK홀딩스  29,700
3  A054620  APS홀딩스  19,400

In [107]:
df['cd'] = df['cd'].replace('A', '', regex=True)

In [108]:
df

       cd      nm   close
0  060310      3S   2,920
1  095570  AJ네트웍스   6,250
2  006840   AK홀딩스  29,700
3  054620  APS홀딩스  19,400

In [110]:
# 132
df['close'] = df['close'].replace(',', '', regex=True)
df['close'].astype(np.int64)

0     2920
1     6250
2    29700
3    19400
Name: close, dtype: int64

In [115]:
# 133
data = [
    [1, 2, 3],
    [np.nan, 5, 6],
    [7, np.nan, 9],
    [10, 11, np.nan]
]
df = pd.DataFrame(data)
df.iloc[:,:].dropna()

     0    1    2
0  1.0  2.0  3.0

In [116]:
df

      0     1    2
0   1.0   2.0  3.0
1   NaN   5.0  6.0
2   7.0   NaN  9.0
3  10.0  11.0  NaN

In [117]:
# 134
data = [
    [1, 1, np.nan],
    [10, np.nan, 10],
    [2, 3, 4]
]
columns = ['col0', 'col1', 'col2']
df = pd.DataFrame(data, columns=columns)
df

   col0  col1  col2
0     1   1.0   NaN
1    10   NaN  10.0
2     2   3.0   4.0

In [118]:
df.dropna(axis=1)

   col0
0     1
1    10
2     2

In [119]:
# 134 answer
df.dropna(subset='col2')

   col0  col1  col2
1    10   NaN  10.0
2     2   3.0   4.0

In [120]:
# 135
data = [
    [1, 1, np.nan],
    [10, np.nan, 10],
    [2, 3, 4]
]
columns = ['col0', 'col1', 'col2']
df = pd.DataFrame(data, columns=columns)
df.fillna(0)

   col0  col1  col2
0     1   1.0   0.0
1    10   0.0  10.0
2     2   3.0   4.0

In [121]:
# 136 answer
df.fillna(method='ffill')

C:\Users\hkpar\AppData\Local\Temp\ipykernel_13112\3065297067.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

   col0  col1  col2
0     1   1.0   NaN
1    10   1.0  10.0
2     2   3.0   4.0

In [122]:
# 137
import pandas as pd
import numpy as np

data = [
    [1, 1, np.nan],
    [10, np.nan, 10],
    [2, 3, 4]
]
columns = ['col0', 'col1', 'col2']
df = pd.DataFrame(data, columns=columns)
df.isna()

    col0   col1   col2
0  False  False   True
1  False   True  False
2  False  False  False

In [123]:
# 138
df.notna()

   col0   col1   col2
0  True   True  False
1  True  False   True
2  True   True   True

In [124]:
# 139
import pandas as pd
import numpy as np

data = np.arange(9).reshape(3, 3)
df = pd.DataFrame(data)
df

   0  1  2
0  0  1  2
1  3  4  5
2  6  7  8

In [129]:
df.loc[0, 0] = np.where(df.loc[0, 0] == 0, 100, np.nan)
df

C:\Users\hkpar\AppData\Local\Temp\ipykernel_13112\600636149.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'nan' has dtype incompatible with int32, please explicitly cast to a compatible dtype first.
  df.loc[0, 0] = np.where(df.loc[0, 0] == 0, 100, np.nan)

     0  1  2
0  NaN  1  2
1  3.0  4  5
2  6.0  7  8

In [131]:
# 139 answer
df.replace(np.nan, 100)

       0  1  2
0  100.0  1  2
1    3.0  4  5
2    6.0  7  8

In [132]:
# 140
import pandas as pd

data = {
    'fruit': ['apple', 'orange', 'orange', 'apple', 'apple', 'apple'],
    'weight': [1.5, 1.3, 3.7, 2.4, 1.7, 1.8]
}
df = pd.DataFrame(data)
df['fruit'] = df['fruit'].astype('category')